fruits = ["apple", "banana", "cherry", "kiwi", "mango"]


# сначало работает for x in fruits затем if "a" in x, а полученное значение это X
newlist = [x for x in fruits if "a" in x]

print(newlist)

newlist = [x.upper() for x in fruits]

# Почему именно такая последовательность элементов?
# Синтаксис [выражение for элемент in последовательность if условие] задуман так, чтобы напоминать естественный порядок мысли:
#
# "Что я хочу добавить?"
# Начинаем с выражение, потому что это результат, который мы хотим получить в новом списке.

# "Откуда я беру элементы?"#
# Затем идёт for элемент in последовательность, указывая, откуда мы берём данные

# "Какие элементы я хочу включить?"
# Наконец, добавляем if условие, чтобы ограничить выбор элементов.
