# Пользователь вводит высоту треугольника
height = int(input("Введите высоту треугольника: "))

for i in range(1, height + 1):  # Проходим по строкам
    # Печатаем пробелы перед звездами (для выравнивания по центру)
    print(" " * (height - i), end="")

    # Печатаем звездочки для границ треугольника
    if i == 1:
        print("*")
    elif i == height:
        print("*" * (2 * i - 1))
    else:
        print("*" + " " * (2 * i - 3) + "*")
